[
  {
    "title": "3 dead as truck hits autorickshaw in Gazipur’s Kaliakair",
    "link": "https://www.unb.com.bd/category/Bangladesh/3-dead-as-truck-hits-autorickshaw-in-gazipurs-kaliakair/131193",
    "text": "Three people were killed and two others injured as a speeding truck crashed into a battery-run autorickshaw on Dhaka-Tangail highway in Gazipur’s Kaliakair upazila on Monday (February 19, 2024) morning. The identities of the deceased could not be known immediately. Naojhor Highway police station Officer-in-Charge (OC) Shahdat Hossain said the Tangail–bound truck hit the autorickshaw in Sutrapur area, leaving five people including the autorickshaw driver injured. Members of fire service ...",
    "reason": "A speeding truck crashed into a battery-run autorickshaw.",
    "sequence_of_actions": "The truck, bound for Tangail, hit the autorickshaw in Sutrapur area, resulting in casualties and injuries."
  },
  {
    "title": "Six cops injured in road accident during vehicle check in Sylhet",
    "link": "https://www.unb.com.bd/category/Bangladesh/six-cops-injured-in-road-accident-during-vehicle-check-in-sylhet/130957",
    "text": "During a routine vehicle inspection on the Sylhet-Sunamganj road at Temukhi, Sylhet district, six policemen sustained injuries when a bus hit them early Thursday (February 15, 2024) morning. The incident occurred as the officers were operating a check-post established to enhance road safety measures. The injured officers include Azbahar Ali Sheikh, Additional DIG and Deputy Commissioner of Sylhet Metropolitan Police; Kawsar Dastagir, Additional Deputy Commissioner; Zahurul Islam, Assista...",
    "reason": "A bus hit policemen during a routine vehicle inspection.",
    "sequence_of_actions": "The bus from Sunamganj, while undergoing checks, struck the policemen, causing injuries."
  },
  {
    "title": "Reckless driving triggers multi-vehicle collision in Ctg’s Bangabandhu Tunnel",
    "link": "https://www.unb.com.bd/category/Bangladesh/reckless-driving-triggers-multi-vehicle-collision-in-ctgs-bangabandhu-tunnel/130693",
    "text": "In a distressing incident last night, reckless driving led to a multi-vehicle crash inside the Bangabandhu Tunnel in Chattogram, resulting in damage to at least five vehicles and injuring several people. The accident, occurring in one of the tunnel's lanes, underscores the growing concerns over traffic safety. Assistant Sub-Inspector Billal Hossain of the Karnaphuli Police Station, under the Chattogram Metropolitan Police, reported that the chain-reaction collision was initiated by a pri...",
    "reason": "Reckless driving led to a multi-vehicle crash inside the Bangabandhu Tunnel.",
    "sequence_of_actions": "A private car lost control due to excessive speed, colliding with nearby cars and causing a chain-reaction collision."
  },
  {
    "title": "Out of control truck smashes into two other vehicles on Dhk-Ctg Highway; helper dead, 10 injured",
    "link": "https://www.unb.com.bd/category/Bangladesh/out-of-control-truck-smashes-into-two-other-vehicles-on-dhk-ctg-highway-helper-dead-10-injured/130617",
    "text": "A truck driver's helper was killed and 10 other people including the driver were injured as he lost control of his vehicle and hit a microbus and another truck on the Dhaka-Chattogram Highway in Sitakunda on Friday. The deceased helper's name could not be known. Bean produced in Chattogram’s Sitakunda exported to Italy for the first time Fire Service and highway police sources said the accident happened in the early morning when the goods-laden truck crashed into the other truck, and the...",
    "reason": "The truck driver lost control of his vehicle, leading to a crash involving a microbus and another truck.",
    "sequence_of_actions": "The truck crashed into another truck and then a microbus from behind due to the driver losing control, causing casualties and injuries."
  },
  {
    "title": "Two die as motorcycle loses control in Kishoreganj",
    "link": "https://www.unb.com.bd/category/Bangladesh/two-die-as-motorcycle-loses-control-in-kishoreganj/129617",
    "text": "Two people died and one other was injured after the motorcycle they were on lost control and hit a road pillar on the All-weather Road in Mithamoin upazila of Kishoreganj on Monday afternoon. The incident happened on the south side of Dhaki Bridge in Dhaki Union of the upazila at around 4:45 pm on Monday. The deceased were identified as Yasin, 25 of Chanpur area of Mithamoin upazila and Amir Hossain, 20 of Kathal Bari area of Companiganj Police Station in Sylhet. The injured is Mizanur Rahman, 30, of the Ghagra Dayahati area. Mithamoin Police Station Officer-in-Charge Ahsan Habib confirmed the matter. The three people were coming from Itna to Mithamoin by motorcycle. On the way, the motorcycle collided with a side pillar on the south side of Dhaki Bridge in Dhaki Union of Mithamoin Upazila at around 4:45pm. Yasin and Amir Ali died on the spot, and Mizanur Rahman was seriously injured, he said. Mizanur was referred to Kishoreganj Hospital in a critical condition, added the OC.",
    "reason": "The motorcycle lost control and collided with a road pillar.",
    "sequence_of_actions": "While traveling from Itna to Mithamoin, the motorcycle hit a road pillar, resulting in two fatalities and one injury."
  },
  {
    "title": "Motorcyclist dies in Bogura road crash",
    "link": "https://www.unb.com.bd/category/Bangladesh/motorcyclist-dies-in-bogura-road-crash/129246",
    "text": "A motorcyclist died after a truck ran him over in Bogura’s Kahalu upazila on Monday. The deceased was identified as Amzad Hossain, 45, of Kalai Damgara of the upazila. The incident happened after Amzad lost control of his motorcycle and fell on the road, following which a truck ran him over on the Namuja-Baro Mile road in Kaura Bazar of Kalai union of the upazila on Monday. Kahalu Police Station Officer-in-Charge Selim Reza confirmed the matter.",
    "reason": "The motorcyclist lost control and fell on the road, which led to the accident.",
    "sequence_of_actions": "The motorcyclist, Amzad Hossain, lost control of his motorcycle. He fell on the road. Subsequently, a truck ran him over."
  },
  {
    "title": "Teen killed as an unidentified vehicle runs over him in Jatrabari",
    "link": "https://www.unb.com.bd/category/Bangladesh/teen-killed-as-an-unidentified-vehicle-runs-over-him-in-jatrabari/128609",
    "text": "A teenager was killed after being run over by an unidentified vehicle in the capital's Jatrabari area on Thursday morning. The deceased was identified as Nayem,13, a street boy living in the area. The accident occurred this morning when the vehicle hit Nayem under the flyover, opposite of Jatrabari Kalapatti, leaving him dead on the spot, said Md. Kamruzzaman, sub-inspector of Jatrabari Police Station.",
    "reason": "A teenager was run over by an unidentified vehicle.",
    "sequence_of_actions": "The teenager, Nayem, was hit by an unidentified vehicle under the flyover in Jatrabari."
  },
  {
    "title": "Police arrest driver of SUV that hit and killed 3 including child in Dhaka's Khilkhet",
    "link": "https://www.unb.com.bd/category/Bangladesh/police-arrest-driver-of-suv-that-hit-and-killed-3-including-child-in-dhakas-khilkhet/128206",
    "text": "Police have arrested the driver of a sport utility vehicle (SUV) that ploughed into a passenger shed in Dhaka's Khilkhet last night, killing three people and injuring one. The driver of the vehicle, Dishan, was arrested on Thursday in a case filed by victim Armina’s husband at the police station, said Khilkhet Police Station Officer-in-Charge Sheikh Aminul Bashar.",
    "reason": "An SUV ploughed into a passenger shed, causing fatalities.",
    "sequence_of_actions": "The SUV, driven by Dishan, lost control and crashed into a passenger shed in Khilkhet, resulting in three deaths and one injury."
  },
  {
    "title": "Two die as sand-laden truck crushes autorickshaw in Tangail",
    "link": "https://www.unb.com.bd/category/Bangladesh/two-die-as-sand-laden-truck-crushes-autorickshaw-in-tangail/128118",
    "text": "Two people died and three others were injured after a sand-laden truck collided with a bus and fell on top of a CNG-run autorickshaw at Kalihati upazila of Tangail on Tuesday. The incident happened on the Tangail-Mymensingh road in Chatipara area of the upazila on Tuesday afternoon.",
    "reason": "A collision involving a sand-laden truck, a bus, and an autorickshaw led to fatalities.",
    "sequence_of_actions": "A sand-laden truck collided with a bus and subsequently fell on a CNG-run autorickshaw, resulting in two deaths and injuries."
  },
  {
    "title": "Two motorcyclists killed in Sylhet road crash",
    "link": "https://www.unb.com.bd/category/Bangladesh/two-motorcyclists-killed-in-sylhet-road-crash/127638",
    "text": "Two men were killed in a head-on collision between their motorcycles on the Sylhet-Tamabil highway on Saturday night. The deceased were identified as Al-Amin, 25, resident of Shantinagar village of Gowainghat upazila, and Shakil Ahmed Imon, 30, resident of Laxmipur village in Jaintapur upazila. Another person named Saidul Alam, who was riding with Imon, was injured in the accident. The accident occurred before the Tamabil police outpost in Sylhet’s Gowainghat upazila. Quoting locals, police said Al-Amin was going to Naljuri by a motorcycle from Tamabil Point. Imon and Saidul were going to Jaflong from Jaintapur by another motorcycle on Saturday night. On the way, the two motorcycles collided in front of Tamabil police outpost on Tamabil-Sylhet highway. All three motorcyclists were injured. Later, locals rescued and rushed them to Jaintapur Upazila Health Complex where the duty doctor declared Al Amin and Shakil dead. Rafiqul Islam, Officer-in-Charge (OC) of Gowainghat Police Station, said both motorcycles have been recovered.",
    "reason": "A head-on collision occurred between two motorcycles.",
    "sequence_of_actions": "Al-Amin and Shakil Ahmed Imon, along with Saidul Alam, were riding their motorcycles when they collided in front of Tamabil police outpost, resulting in two deaths and one injury."
  }
]